src/InformationRegisters/УПЖКХ_СведенияДляВзаиморасчетовПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>УПЖКХ_СведенияДляВзаиморасчетовПоЛС</Name>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛицевойСчет</Name>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КВП_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>КВП_ЛицевыеСчета</Name>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛицевойСчет</Name>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ГП_ПриборыУчета/Ext/Module.bsl
// Гарант+ Килипенко 11.09.2024 [F00227694] Доработка документа ввод показаний счетчика ++
#Область ПрограммныйИнтерфейс

// Параметры:
//  ЛицевойСчет - СправочникСсылка.КВП_ЛицевыеСчета
//  ТолькоДействующиеСчетчики - Булево, Неопределено - По умолчанию Истина
//  ТолькоДействующиеУслуги - Булево, Неопределено - По умолчанию Истина
// Возвращаемое значение:
//  - ТаблицаЗначений
//      * Объект - СправочникСсылка.КВП_ЛицевыеСчета
//      * ПриборУчета - СправочникСсылка.КВП_Счетчики
//      * Организация - СправочникСсылка.Организации
//      * Действует - Булево
//      * ДатаНачала - Дата
//      * ДатаПоверки - Дата
//      * НомерПломбы - Строка
//      * ПричинаОтключения - ПеречислениеСсылка.УПЖКХ_ПричиныОтключенияПриборовУчета
//      * Услуга - ПеречислениеСсылка.КВП_Услуги
//      * УслугаДействует - Булево
Функция ПолучитьПриборыУчетаДоговораПоЛицевомуСчету(
        Знач ЛицевойСчет, Знач ТолькоДействующиеСчетчики = Неопределено, ТолькоДействующиеУслуги = Неопределено) Экспорт

    ТолькоДействующиеСчетчики = ?(ТолькоДействующиеСчетчики = Неопределено, Истина, ТолькоДействующиеСчетчики);
    ТолькоДействующиеУслуги = ?(ТолькоДействующиеУслуги = Неопределено, Истина, ТолькоДействующиеУслуги);

    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	СведенияДляВзаиморасчетовПоЛС.Договор КАК Договор,
        |	СведенияДляВзаиморасчетовПоЛС.Организация КАК Организация,
        |	СведенияДляВзаиморасчетовПоЛС.Контрагент КАК Контрагент
        |ПОМЕСТИТЬ ВТ_ДоговорыЛС
        |ИЗ
        |	РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС.СрезПоследних(, ЛицевойСчет = &ЛицевойСчет) КАК СведенияДляВзаиморасчетовПоЛС
        |ГДЕ
        |	СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет = &ЛицевойСчет
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |	СведенияДляВзаиморасчетовПоЛС.Период КАК Период,
        |	СведенияДляВзаиморасчетовПоЛС.Регистратор КАК Регистратор,
        |	СведенияДляВзаиморасчетовПоЛС.Организация КАК Организация,
        |	СведенияДляВзаиморасчетовПоЛС.ЛицевойСчет КАК ЛицевойСчет,
        |	СведенияДляВзаиморасчетовПоЛС.Договор КАК Договор,
        |	СведенияДляВзаиморасчетовПоЛС.Контрагент КАК Контрагент
        |ПОМЕСТИТЬ ВТ_ЛицевыеСчетаДоговора
        |ИЗ
        |	РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС.СрезПоследних КАК СведенияДляВзаиморасчетовПоЛС
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДоговорыЛС КАК ВТ_ДоговорыЛС
        |		ПО СведенияДляВзаиморасчетовПоЛС.Договор = ВТ_ДоговорыЛС.Договор
        |			И СведенияДляВзаиморасчетовПоЛС.Контрагент = ВТ_ДоговорыЛС.Контрагент
        |			И СведенияДляВзаиморасчетовПоЛС.Организация = ВТ_ДоговорыЛС.Организация
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ИсторияСостоянийПриборовУчета.Период КАК Период,
        |	ИсторияСостоянийПриборовУчета.Регистратор КАК Регистратор,
        |	ИсторияСостоянийПриборовУчета.Объект КАК Объект,
        |	ИсторияСостоянийПриборовУчета.ПриборУчета КАК ПриборУчета,
        |	ИсторияСостоянийПриборовУчета.Действует КАК Действует,
        |	ИсторияСостоянийПриборовУчета.ДатаНачала КАК ДатаНачала,
        |	ИсторияСостоянийПриборовУчета.ДатаПоверки КАК ДатаПоверки,
        |	ИсторияСостоянийПриборовУчета.НомерПломбы КАК НомерПломбы,
        |	ИсторияСостоянийПриборовУчета.ПричинаОтключения КАК ПричинаОтключения
        |ПОМЕСТИТЬ ВТ_ИсторияСостоянийПриборовУчета
        |ИЗ
        |	РегистрСведений.УПЖКХ_ИсторияСостоянийПриборовУчета.СрезПоследних КАК ИсторияСостоянийПриборовУчета
        |ГДЕ
        |	ИсторияСостоянийПриборовУчета.Объект В
        |			(ВЫБРАТЬ
        |				ВТ_ЛицевыеСчетаДоговора.ЛицевойСчет
        |			ИЗ
        |				ВТ_ЛицевыеСчетаДоговора)
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ВТ_ИсторияСостоянийПриборовУчета.Период КАК ПериодСчетчика,
        |	НазначенныеНачисления.Организация КАК Организация,
        |	ВТ_ИсторияСостоянийПриборовУчета.Объект КАК Объект,
        |	ВТ_ИсторияСостоянийПриборовУчета.ПриборУчета КАК ПриборУчета,
        |	ВТ_ИсторияСостоянийПриборовУчета.Действует КАК СчетчикДействует,
        |	ВТ_ИсторияСостоянийПриборовУчета.ДатаНачала КАК ДатаНачала,
        |	ВТ_ИсторияСостоянийПриборовУчета.ДатаПоверки КАК ДатаПоверки,
        |	ВТ_ИсторияСостоянийПриборовУчета.НомерПломбы КАК НомерПломбы,
        |	ВТ_ИсторияСостоянийПриборовУчета.ПричинаОтключения КАК ПричинаОтключения,
        |	НазначенныеНачисления.Услуга КАК Услуга,
        |	НазначенныеНачисления.Действует КАК УслугаДействует,
        |	НазначенныеНачисления.ДатаИзменения КАК ДатаИзменения
        |ИЗ
        |	ВТ_ИсторияСостоянийПриборовУчета КАК ВТ_ИсторияСостоянийПриборовУчета
        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КВП_НазначенныеНачисления.СрезПоследних КАК НазначенныеНачисления
        |		ПО ВТ_ИсторияСостоянийПриборовУчета.Объект = НазначенныеНачисления.Объект
        |			И ВТ_ИсторияСостоянийПриборовУчета.ПриборУчета.ВидУслуги = НазначенныеНачисления.Услуга
        |			И (НазначенныеНачисления.Действует = ИСТИНА)
        |";

    Запрос.УстановитьПараметр("ЛицевойСчет", ЛицевойСчет);
    Если ТолькоДействующиеСчетчики = Ложь Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ИсторияСостоянийПриборовУчета.Действует = ИСТИНА", "");
    КонецЕсли;
    Если ТолькоДействующиеУслуги = Ложь Тогда
        Запрос.Текст = СтрЗаменитьПоРегулярномуВыражению(Запрос.Текст, "И\s+\(?НазначенныеНачисления.Действует = ИСТИНА\)?", "");
    КонецЕсли;

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить();

    Возврат РезультатФункции;
КонецФункции

// Гарант+ Килипенко 01.10.2024 [F00228899] Формирование комментария со списком договоров док. ввода показаний ++
//
// Параметры:
//  МассивПриборовУчета - Массив из СправочникСсылка.КВП_Счетчики
//  ДатаАктуальности - Дата, Неопределено
// Возвращаемое значение:
//  - Массив из СправочникСсылка.ДоговорыКонтрагентов
Функция ПолучитьМассивДоговоровВзаиморасчетовДляПриборовУчетаПоЛС(Знач МассивПриборовУчета, Знач ДатаАктуальности = Неопределено) Экспорт
    Запрос = Новый Запрос;
    Запрос.Текст =
        "ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	УПЖКХ_ИсторияСостоянийПриборовУчета.Объект КАК Объект,
        |	УПЖКХ_ИсторияСостоянийПриборовУчета.ПриборУчета КАК ПриборУчета,
        |	УПЖКХ_ИсторияСостоянийПриборовУчета.Действует КАК Действует,
        |	УПЖКХ_ИсторияСостоянийПриборовУчета.ДатаНачала КАК ДатаНачала,
        |	УПЖКХ_ИсторияСостоянийПриборовУчета.ДатаПоверки КАК ДатаПоверки,
        |	УПЖКХ_ИсторияСостоянийПриборовУчета.ПричинаОтключения КАК ПричинаОтключения
        |ПОМЕСТИТЬ ВТ_СведенияПУ
        |ИЗ
        |	РегистрСведений.УПЖКХ_ИсторияСостоянийПриборовУчета.СрезПоследних(&ДатаАктуальности, ПриборУчета В (&МассивПриборовУчета)) КАК УПЖКХ_ИсторияСостоянийПриборовУчета
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ
        |	ВЫРАЗИТЬ(ВТ_СведенияПУ.Объект КАК Справочник.КВП_ЛицевыеСчета) КАК ЛицевойСчет,
        |	ВТ_СведенияПУ.ПриборУчета КАК ПриборУчета
        |ПОМЕСТИТЬ ВТ_ПУЛицевыхСчетов
        |ИЗ
        |	ВТ_СведенияПУ КАК ВТ_СведенияПУ
        |ГДЕ
        |	ВТ_СведенияПУ.Объект ССЫЛКА Справочник.КВП_ЛицевыеСчета
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |	КВП_ЛицевыеСчета.ЛицевойСчет КАК ЛицевойСчет
        |ПОМЕСТИТЬ ВТ_ЛицевыеСчета
        |ИЗ
        |	РегистрСведений.КВП_ЛицевыеСчета.СрезПоследних(
        |			&ДатаАктуальности,
        |			ЛицевойСчет В
        |				(ВЫБРАТЬ
        |					ВТ_ПУЛицевыхСчетов.ЛицевойСчет
        |				ИЗ
        |					ВТ_ПУЛицевыхСчетов)) КАК КВП_ЛицевыеСчета
        |ГДЕ
        |	КВП_ЛицевыеСчета.Действует = ИСТИНА
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |	СведенияДляВзаиморасчетовПоЛС.Договор КАК Договор
        |ИЗ
        |	РегистрСведений.УПЖКХ_СведенияДляВзаиморасчетовПоЛС.СрезПоследних(
        |			&ДатаАктуальности,
        |			ЛицевойСчет В
        |				(ВЫБРАТЬ
        |					ВТ_ЛицевыеСчета.ЛицевойСчет
        |				ИЗ
        |					ВТ_ЛицевыеСчета)) КАК СведенияДляВзаиморасчетовПоЛС
        |";

    Если ДатаАктуальности = Неопределено Тогда
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДатаАктуальности", "");
    Иначе
        Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
    КонецЕсли;
    Запрос.УстановитьПараметр("МассивПриборовУчета", МассивПриборовУчета);

    РезультатЗапроса = Запрос.Выполнить();
    РезультатФункции = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Договор");
    Возврат РезультатФункции;
КонецФункции // Гарант+ Килипенко 01.10.2024 [F00228899] Формирование комментария со списком договоров док. ввода показаний --

#КонецОбласти // ПрограммныйИнтерфейс
// Гарант+ Килипенко 11.09.2024 [F00227694] Доработка документа ввод показаний счетчика --
